In [202]:
import pandas as pd
import numpy as np

In [203]:
a = [2, 5, 7, 8, 3]

In [204]:
b = pd.Series(a)
b

0    2
1    5
2    7
3    8
4    3
dtype: int64

In [205]:
from datetime import date

In [206]:
ind = [date(y, m, d) for y, m, d in [(2018, 1, 15), (2018, 1, 17), (2018, 1, 18), (2018, 1, 21), (2018, 1, 31)]]
ind

[datetime.date(2018, 1, 15),
 datetime.date(2018, 1, 17),
 datetime.date(2018, 1, 18),
 datetime.date(2018, 1, 21),
 datetime.date(2018, 1, 31)]

In [207]:
b = pd.Series(a, index = ind)

In [208]:
b

2018-01-15    2
2018-01-17    5
2018-01-18    7
2018-01-21    8
2018-01-31    3
dtype: int64

In [209]:
b.index[0].year

2018

In [210]:
b.index[0].month

1

In [211]:
b.index[0].day

15

In [212]:
b.index = pd.to_datetime(b.index, format = '%Y-%m-%d')

In [213]:
b.index

DatetimeIndex(['2018-01-15', '2018-01-17', '2018-01-18', '2018-01-21',
               '2018-01-31'],
              dtype='datetime64[ns]', freq=None)

In [214]:
b.index.year

Int64Index([2018, 2018, 2018, 2018, 2018], dtype='int64')

In [215]:
b.index.month

Int64Index([1, 1, 1, 1, 1], dtype='int64')

In [216]:
b.index.day

Int64Index([15, 17, 18, 21, 31], dtype='int64')

In [217]:
b = pd.Series(a, index=[0, 1, 0, 2, 1])
b

0    2
1    5
0    7
2    8
1    3
dtype: int64

In [218]:
b.index=[10,11,12,13,14]
b

10    2
11    5
12    7
13    8
14    3
dtype: int64

In [219]:
b=pd.Series(a, dtype=np.float64)

In [220]:
b = pd.Series(a)
b = b.astype(np.float64)
b

0    2.0
1    5.0
2    7.0
3    8.0
4    3.0
dtype: float64

In [221]:
d = {'1st':'a', '2nd':'b', '3rd':'c', '4th':'d', '5th':'e'}

In [222]:
b = pd.Series(d)
b

1st    a
2nd    b
3rd    c
4th    d
5th    e
dtype: object

In [223]:
b = pd.Series([5, 2, 6, 1, 6, 8, 7])

In [224]:
b.index

RangeIndex(start=0, stop=7, step=1)

In [225]:
b.values

array([5, 2, 6, 1, 6, 8, 7], dtype=int64)

In [226]:
b

0    5
1    2
2    6
3    1
4    6
5    8
6    7
dtype: int64

In [227]:
b[0]

5

In [228]:
b[[0,5]]

0    5
5    8
dtype: int64

In [229]:
b.head()

0    5
1    2
2    6
3    1
4    6
dtype: int64

In [230]:
b.tail(3)

4    6
5    8
6    7
dtype: int64

In [231]:
b[b>5]

2    6
4    6
5    8
6    7
dtype: int64

In [232]:
b[(b==7) | (b%3==0)]

2    6
4    6
6    7
dtype: int64

In [233]:
b = pd.Series([5, 2, 6, 1, 6, 8, 7])

In [234]:
b

0    5
1    2
2    6
3    1
4    6
5    8
6    7
dtype: int64

In [235]:
b[b>5] = 0
b

0    5
1    2
2    0
3    1
4    0
5    0
6    0
dtype: int64

In [236]:
b = b.drop(index=[2,4,5,6])
b

0    5
1    2
3    1
dtype: int64

In [237]:
authors = pd.DataFrame({'author_id': [1, 2, 3], 'author_name': ['Pushkin', 'Tolstoy', 'Dostoevsky']},
                       columns = ['author_id', 'author_name'])

In [238]:
authors

   author_id author_name
0          1     Pushkin
1          2     Tolstoy
2          3  Dostoevsky

In [239]:
books = pd.DataFrame({'author_id': [2, 3, 3, 4], 
                      'book_title': ['War and Peace', 'The Idiot', 'Crime and Punishment', 'Fathers and Sons']})

In [240]:
books

   author_id            book_title
0          2         War and Peace
1          3             The Idiot
2          3  Crime and Punishment
3          4      Fathers and Sons

In [241]:
df1 = pd.merge(authors, books, on='author_id', how='inner')

In [242]:
df1

   author_id author_name            book_title
0          2     Tolstoy         War and Peace
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  Crime and Punishment

In [243]:
df2 = pd.merge(authors, books, on='author_id', how='left')
df2

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment

In [244]:
df3 = pd.merge(authors, books, on='author_id', how='right')
df3

   author_id author_name            book_title
0          2     Tolstoy         War and Peace
1          3  Dostoevsky             The Idiot
2          3  Dostoevsky  Crime and Punishment
3          4         NaN      Fathers and Sons

In [245]:
df4 = pd.merge(authors, books, on='author_id', how='outer')
df4

   author_id author_name            book_title
0          1     Pushkin                   NaN
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

In [246]:
df4.loc[df4['book_title'].isnull(), :]

   author_id author_name book_title
0          1     Pushkin        NaN

In [247]:
df4.loc[df4['book_title'].notnull(),:]

   author_id author_name            book_title
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

In [248]:
df4['book_title'] = df4['book_title'].fillna('unknown')
df4

   author_id author_name            book_title
0          1     Pushkin               unknown
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4         NaN      Fathers and Sons

In [249]:
df4['author_name'].fillna('unknown', inplace=True)
df4

   author_id author_name            book_title
0          1     Pushkin               unknown
1          2     Tolstoy         War and Peace
2          3  Dostoevsky             The Idiot
3          3  Dostoevsky  Crime and Punishment
4          4     unknown      Fathers and Sons

In [250]:
df4.loc[(df4['author_name'] != 'unknown') & (df4['book_title'] != 'unknown'), 'quantity'] = 1

In [251]:
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown       NaN
1          2     Tolstoy         War and Peace       1.0
2          3  Dostoevsky             The Idiot       1.0
3          3  Dostoevsky  Crime and Punishment       1.0
4          4     unknown      Fathers and Sons       NaN

In [252]:
df4['quantity'].fillna(0, inplace = True)

In [253]:
df4['quantity'] = df4['quantity'].astype(int)
df4

   author_id author_name            book_title  quantity
0          1     Pushkin               unknown         0
1          2     Tolstoy         War and Peace         1
2          3  Dostoevsky             The Idiot         1
3          3  Dostoevsky  Crime and Punishment         1
4          4     unknown      Fathers and Sons         0

In [254]:
df4.set_index('author_id', inplace = True)

In [255]:
df4

          author_name            book_title  quantity
author_id
1             Pushkin               unknown         0
2             Tolstoy         War and Peace         1
3          Dostoevsky             The Idiot         1
3          Dostoevsky  Crime and Punishment         1
4             unknown      Fathers and Sons         0

In [257]:
df4.reset_index(inplace=True)
df4

   index  author_id author_name            book_title  quantity
0      0          1     Pushkin               unknown         0
1      1          2     Tolstoy         War and Peace         1
2      2          3  Dostoevsky             The Idiot         1
3      3          3  Dostoevsky  Crime and Punishment         1
4      4          4     unknown      Fathers and Sons         0

In [258]:
df4['price']=500

In [259]:
df4

   index  author_id author_name            book_title  quantity  price
0      0          1     Pushkin               unknown         0    500
1      1          2     Tolstoy         War and Peace         1    500
2      2          3  Dostoevsky             The Idiot         1    500
3      3          3  Dostoevsky  Crime and Punishment         1    500
4      4          4     unknown      Fathers and Sons         0    500

In [261]:
df4=df4.drop('price', axis=1)
df4

   index  author_id author_name            book_title  quantity
0      0          1     Pushkin               unknown         0
1      1          2     Tolstoy         War and Peace         1
2      2          3  Dostoevsky             The Idiot         1
3      3          3  Dostoevsky  Crime and Punishment         1
4      4          4     unknown      Fathers and Sons         0

In [262]:
df4 = df4.drop(3, axis=0)
df4

   index  author_id author_name        book_title  quantity
0      0          1     Pushkin           unknown         0
1      1          2     Tolstoy     War and Peace         1
2      2          3  Dostoevsky         The Idiot         1
4      4          4     unknown  Fathers and Sons         0

In [263]:
df4 = df4.append(pd.DataFrame({'author_id': [2], 
                                     'author_name': ['Tolstoy'], 
                                     'book_title': ['War and Peace'], 
                                     'quantity': [1]},
                                     columns=['author_id', 'author_name', 'book_title', 'quantity']),
                                  ignore_index=True)
df4

C:\Users\qu4n7\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

   author_id author_name        book_title  index  quantity
0          1     Pushkin           unknown    0.0         0
1          2     Tolstoy     War and Peace    1.0         1
2          3  Dostoevsky         The Idiot    2.0         1
3          4     unknown  Fathers and Sons    4.0         0
4          2     Tolstoy     War and Peace    NaN         1

In [264]:
df4 = df4.sort_values(by='author_id')
df4

   author_id author_name        book_title  index  quantity
0          1     Pushkin           unknown    0.0         0
1          2     Tolstoy     War and Peace    1.0         1
4          2     Tolstoy     War and Peace    NaN         1
2          3  Dostoevsky         The Idiot    2.0         1
3          4     unknown  Fathers and Sons    4.0         0

In [265]:
df5 = pd.DataFrame({'author_id': [3, 5], 'author_name': ['Dostoevsky', 'Chekhov'], 
                       'book_title': ['The Gambler', 'Three Sisters'], 'quantity': [2, 3]},
                       columns=['author_id', 'author_name', 'book_title', 'quantity'])
df5

   author_id author_name     book_title  quantity
0          3  Dostoevsky    The Gambler         2
1          5     Chekhov  Three Sisters         3

In [266]:
df8 = pd.concat([df4, df5], axis=0, ignore_index=True)

C:\Users\qu4n7\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [267]:
df8

   author_id author_name        book_title  index  quantity
0          1     Pushkin           unknown    0.0         0
1          2     Tolstoy     War and Peace    1.0         1
2          2     Tolstoy     War and Peace    NaN         1
3          3  Dostoevsky         The Idiot    2.0         1
4          4     unknown  Fathers and Sons    4.0         0
5          3  Dostoevsky       The Gambler    NaN         2
6          5     Chekhov     Three Sisters    NaN         3

In [268]:
prices = pd.DataFrame({'price': [700, 450, 500, 400, 350]}, columns=['price'], index=[1, 2, 3, 5, 6])
prices

   price
1    700
2    450
3    500
5    400
6    350

In [271]:
df9=pd.concat([df8,prices],axis=1)

In [272]:
df9

   author_id author_name        book_title  index  quantity  price
0          1     Pushkin           unknown    0.0         0    NaN
1          2     Tolstoy     War and Peace    1.0         1  700.0
2          2     Tolstoy     War and Peace    NaN         1  450.0
3          3  Dostoevsky         The Idiot    2.0         1  500.0
4          4     unknown  Fathers and Sons    4.0         0    NaN
5          3  Dostoevsky       The Gambler    NaN         2  400.0
6          5     Chekhov     Three Sisters    NaN         3  350.0

In [273]:
df9['total'] =df9['quantity']*df9['price']
df9

   author_id author_name        book_title  index  quantity  price   total
0          1     Pushkin           unknown    0.0         0    NaN     NaN
1          2     Tolstoy     War and Peace    1.0         1  700.0   700.0
2          2     Tolstoy     War and Peace    NaN         1  450.0   450.0
3          3  Dostoevsky         The Idiot    2.0         1  500.0   500.0
4          4     unknown  Fathers and Sons    4.0         0    NaN     NaN
5          3  Dostoevsky       The Gambler    NaN         2  400.0   800.0
6          5     Chekhov     Three Sisters    NaN         3  350.0  1050.0

In [275]:
df9['price'].max()

700.0

In [276]:
df9['price'].min()

350.0

In [277]:
df9['price'].mean()

480.0

In [278]:
df9['price'].median()

450.0

In [279]:
df9['price'].std()

135.09256086106296

In [280]:
df9['price'].var()

18250.0

In [282]:
df9.nlargest(3,'price')

   author_id author_name     book_title  index  quantity  price  total
1          2     Tolstoy  War and Peace    1.0         1  700.0  700.0
3          3  Dostoevsky      The Idiot    2.0         1  500.0  500.0
2          2     Tolstoy  War and Peace    NaN         1  450.0  450.0

In [284]:
df9['author_name'].unique()

array(['Pushkin', 'Tolstoy', 'Dostoevsky', 'unknown', 'Chekhov'],
      dtype=object)

In [285]:
df9['author_name'].nunique()

5

In [286]:
df9['author_name'].value_counts()

Tolstoy       2
Dostoevsky    2
Pushkin       1
Chekhov       1
unknown       1
Name: author_name, dtype: int64

In [288]:
df9['book_title'].apply(lambda x: x.upper())

0             UNKNOWN
1       WAR AND PEACE
2       WAR AND PEACE
3           THE IDIOT
4    FATHERS AND SONS
5         THE GAMBLER
6       THREE SISTERS
Name: book_title, dtype: object

In [289]:
df9.groupby('author_name')['price'].max()

author_name
Chekhov       350.0
Dostoevsky    500.0
Pushkin         NaN
Tolstoy       700.0
unknown         NaN
Name: price, dtype: float64

In [290]:
price_agg=df9.groupby('author_name').agg({'price':'max'})
price_agg

             price
author_name
Chekhov      350.0
Dostoevsky   500.0
Pushkin        NaN
Tolstoy      700.0
unknown        NaN

In [292]:
df4

   author_id author_name        book_title  index  quantity
0          1     Pushkin           unknown    0.0         0
1          2     Tolstoy     War and Peace    1.0         1
4          2     Tolstoy     War and Peace    NaN         1
2          3  Dostoevsky         The Idiot    2.0         1
3          4     unknown  Fathers and Sons    4.0         0

In [293]:
df4.loc[df4['author_id'].isin([1, 2])]

   author_id author_name     book_title  index  quantity
0          1     Pushkin        unknown    0.0         0
1          2     Tolstoy  War and Peace    1.0         1
4          2     Tolstoy  War and Peace    NaN         1

In [295]:
df4.loc[~df4['author_id'].isin([1,2])]

   author_id author_name        book_title  index  quantity
2          3  Dostoevsky         The Idiot    2.0         1
3          4     unknown  Fathers and Sons    4.0         0

In [296]:
df = pd.DataFrame({'Col1':['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'],
                   'Col2':[1, 3, 5, 7, 9, 11, 13, 15]}, columns=['Col1', 'Col2'])

In [298]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
Col1    8 non-null object
Col2    8 non-null int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [299]:
df.describe()

            Col2
count   8.000000
mean    8.000000
std     4.898979
min     1.000000
25%     4.500000
50%     8.000000
75%    11.500000
max    15.000000

In [300]:
df.index = [2, 4, 6, 8, 10, 12, 14, 16]

In [301]:
df

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

In [302]:
df.loc[2, 'Col1']

'a'

In [303]:
df.loc[4,:]

Col1    b
Col2    3
Name: 4, dtype: object

In [304]:
df.loc[2:4, :]

  Col1  Col2
2    a     1
4    b     3

In [306]:
df.iloc[0, :]

Col1    a
Col2    1
Name: 2, dtype: object

In [309]:
df.iloc[0:2,:]

  Col1  Col2
2    a     1
4    b     3

In [310]:
df.loc[df['Col1']=='b', 'Col2']

4    3
Name: Col2, dtype: int64

In [311]:
df.loc[df['Col1']=='b', 'Col2'].values

array([3], dtype=int64)

In [312]:
df.loc[(df['Col2'] > 10) & (df['Col1'] !='g')]

   Col1  Col2
12    f    11
16    h    15

In [313]:
df.loc[(df['Col2'] > 10) | (df['Col2'] %9 == 0), :]

   Col1  Col2
10    e     9
12    f    11
14    g    13
16    h    15

In [314]:
df

   Col1  Col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

In [316]:
df.query('Col1 == "b"')

  Col1  Col2
4    b     3

In [317]:
df.query('Col2 > 10')

   Col1  Col2
12    f    11
14    g    13
16    h    15

In [322]:
df.sample(frac=0.2)

   Col1  Col2
4     b     3
16    h    15

In [323]:
df.sample(frac=1, replace=True)

   Col1  Col2
12    f    11
2     a     1
8     d     7
10    e     9
14    g    13
14    g    13
2     a     1
12    f    11

In [324]:
df.sample(n =3)

  Col1  Col2
6    c     5
8    d     7
2    a     1